Revit 2027 API
BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloopError Property
 Base sketch for extrusion is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidExtrusionCurveloopError { get; }
Public Shared ReadOnly Property InvalidExtrusionCurveloopError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidExtrusionCurveloopError {
	FailureDefinitionId^ get ();
}
static member InvalidExtrusionCurveloopError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace